package days03;

public class Ex06 {

	public static void main(String[] args) {
		/*
		 *  * 10       0000 1010
		 * -10      1111 0110
		 * 'A' 65   0100 0001
		 * 3.14 double 실수 -> 2진수 변환
		 * 예) 0.625 실수 -> 2진수 표현   0.101(2)
		 *     0.625 X 2 = [1].25
		 *     0.25  X 2 = [0].5
		 *     0.5   X 2 = [1].0
		 * 예)    0.101(2) -> 10진수 실수 변환 
		 *    0.    1    0   1
		 *          X    X   X
		 *         2^-1 2^-2 2^-3  
		 * 예) 10.625
		 *    1010.101(2)  부동소수점 정규화
		 *     <---     소수점이 이동한만큼 2^?
		 *    1.010101 X 2^3
		 *      저장할 지수 값 3+127=130 (127 -> 2^7 -1)
		 *   float(4)  [S1][E8      ] [M23] 총 32
		 *               0 1000 0010  010101
		 *                 
		 *      저장할 지수 값 3+1023=1026 (1023 -> 2^10 -1)
		 *   double(8) [S1][E11          ][M52]  총 64
		 *               0  10000000010  010101 
		 *               */
	}

}
